## Exercises I.

1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

2. cd into your exercises folder for this module and run echo env.py >> .gitignore

3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [38]:
import pandas as pd

In [39]:
def get_db_url(db_name):
    from env import host, user, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

In [40]:
sql = '''
SELECT * 
from employees
'''

In [41]:
url = get_db_url("employees")

df = pd.read_sql(sql, url)
df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

5. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?

    b. Intentionally make an error in your SQL query. What does the error message look like?

In [42]:
# a. ValueError: invalid literal for int() with base 10:
# b. ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'from departments' at line 1")
#[SQL: 
#    SELECT  from departments
#]
#(Background on this error at: http://sqlalche.me/e/14/f405)

6. Read the employees and titles tables into two separate DataFrames.

In [43]:
employees_sql = '''
SELECT *
from employees
'''
titles_sql = '''
SELECT *
from titles
'''

In [44]:
url = get_db_url("employees")

employees = pd.read_sql(employees_sql, url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [45]:
titles = pd.read_sql(titles_sql, url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [46]:
employees.shape

(300024, 6)

In [47]:
titles.shape

(443308, 4)

8. Display the summary statistics for each DataFrame.

In [48]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [49]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [50]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [51]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

9. How many unique titles are in the titles DataFrame?

In [52]:
titles.nunique() #7

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

10. What is the oldest date in the to_date column?

In [53]:
titles.sort_values(by='to_date').head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [54]:
# 1985-03-01

11. What is the most recent date in the to_date column?

In [55]:
titles.sort_values(by='to_date').tail(1)

        emp_no     title   from_date     to_date
443307  499999  Engineer  1997-11-30  9999-01-01

In [56]:
# 9999-01-01

In [57]:
titles_sql = '''
SELECT *
FROM titles where to_date != '9999-01-01'
'''
url = get_db_url("employees")
titles = pd.read_sql(titles_sql, url)

In [58]:
titles.sort_values(by='to_date').tail(1)

        emp_no            title   from_date     to_date
167151  446732  Senior Engineer  1992-11-10  2002-08-01

In [59]:
# 2002-08-01

In [60]:
# or just using SQL

titles_sql = '''
SELECT max(to_date) FROM titles WHERE to_date != '9999-01-01'
'''
url = get_db_url("employees")
max_titles_to_date = pd.read_sql(titles_sql, url)
max_titles_to_date.head()

  max(to_date)
0   2002-08-01

In [61]:
# 2002-08-01

## Exercises II
1. Copy the users and roles DataFrames from the examples above.

In [62]:
import numpy as np


users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [63]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [193]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

3. What is the result of using an outer join on the DataFrames

In [194]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [197]:
# error - KeyError: 'id'
# can't join w/o foreign keys because there's nothing to match w/0 foreign keys
# users.drop(columns='role_id').merge(roles.drop(columns='id'), how='inner', left_on='role_id', right_on='id')

5. Load the mpg dataset from PyDataset.

In [ ]:
from pydataset import data
mpg = data('mpg')

6. Output and read the documentation for the mpg dataset.

In [ ]:
data('mpg', show_doc=True)

7. How many rows and columns are in the dataset?

In [ ]:
mpg.shape

8. Check out your column names and perform any cleanup you may want on them.

In [67]:
mpg.columns

Index(['manufacturer', 'model', 'engine_displacement', 'year', 'cylinders',
       'transmission', 'wheel_drive', 'city_mpg', 'highway_mpg', 'fl',
       'class'],
      dtype='object')

In [68]:
mpg.rename(columns={'displ':'engine_displacement', 'cyl':'cylinders', 'trans':'transmission', 'drv':'wheel_drive', 'cty':'city_mpg', 'hwy':'highway_mpg'}, inplace=True)
mpg

,manufacturer,model,engine_displacement,year,cylinders,transmission,wheel_drive,city_mpg,highway_mpg,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

9. Display the summary statistics for the dataset.

In [69]:
mpg.describe()

       engine_displacement         year   cylinders    city_mpg  highway_mpg
count           234.000000   234.000000  234.000000  234.000000   234.000000
mean              3.471795  2003.500000    5.888889   16.858974    23.440171
std               1.291959     4.509646    1.611534    4.255946     5.954643
min               1.600000  1999.000000    4.000000    9.000000    12.000000
25%               2.400000  1999.000000    4.000000   14.000000    18.000000
50%               3.300000  2003.500000    6.000000   17.000000    24.000000
75%               4.600000  2008.000000    8.000000   19.000000    27.000000
max               7.000000  2008.000000    8.000000   35.000000    44.000000

In [70]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   manufacturer         234 non-null    object
 1   model                234 non-null    object
 2   engine_displacement  234 non-null    float64
 3   year                 234 non-null    int64
 4   cylinders            234 non-null    int64
 5   transmission         234 non-null    object
 6   wheel_drive          234 non-null    object
 7   city_mpg             234 non-null    int64
 8   highway_mpg          234 non-null    int64
 9   fl                   234 non-null    object
 10  class                234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

10. How many different manufacturers are there?

In [86]:
len(mpg.manufacturer)

234

In [85]:
len(mpg.manufacturer.unique())

15

11. How many different models are there?

In [198]:
len(mpg.model.unique())
# can also use .value_counts()

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [88]:
mpg['mileage_difference'] = mpg.highway_mpg - mpg.city_mpg
mpg

,manufacturer,model,engine_displacement,year,cylinders,transmission,wheel_drive,city_mpg,highway_mpg,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [84]:
mpg['average_mileage'] = (mpg.city_mpg + mpg.highway_mpg)/2
mpg

,manufacturer,model,engine_displacement,year,cylinders,transmission,wheel_drive,city_mpg,highway_mpg,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [202]:
# another way using axis:
# mpg['average_mileage'] = mpg[['city_mpg', 'highway_mpg']].mean(axis = 1)

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [204]:
# mpg.is_automatic = mpg.transmission.apply(lambada value : value[0] == 'a')
# mpg.head()

In [100]:
mpg.is_automatic = np.where(mpg.transmission.str.contains('auto'), True, False)
mpg

,manufacturer,model,engine_displacement,year,cylinders,transmission,wheel_drive,city_mpg,highway_mpg,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [95]:
mpg[mpg.average_mileage == max(mpg.average_mileage)]

,manufacturer,model,engine_displacement,year,cylinders,transmission,wheel_drive,city_mpg,highway_mpg,fl,class,mileage_difference,average_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

16. Do automatic or manual cars have better miles per gallon?

In [110]:
mpg.average_mileage.mean() #need to groupby is_automatic 1st

20.14957264957265

In [111]:
mpg.groupby(by='is_automatic').average_mileage.mean() # the manual gets better mpg

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

### Exercises III
1. Use your get_db_url function to help you explore the data from the chipotle database.

In [113]:
def get_db_url(db_name):
    from env import host,user,password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

In [114]:
url = get_db_url('chipotle')

In [115]:
sql = '''
SELECT *
FROM orders
'''

In [117]:
chipotle = pd.read_sql(sql, url)
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

2. What is the total price for each order?

In [175]:
chipotle.item_price = chipotle.item_price.replace('[\$]', '', regex=True).astype(float)

chipotle.head(10)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",10.98
6,7,3,1,Side of Chips,nan,1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",11.75
8,9,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]",9.25
9,10,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]",9.25

In [206]:
# if the quantity wasn't already considered in the 'item_price' column, could handle like this:

# chipotle['new_item_price'] = chipotle.item_price * chipotle.quantity
# chipotle.head()

In [205]:
order_total = chipotle.groupby(by='order_id')['item_price'].sum()
order_total.head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

3. What are the most popular 3 items?

In [131]:
most_popular_items = chipotle.groupby(by='item_name')['item_name'].count().nlargest(3, keep='all')

most_popular_items

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

4. Which item has produced the most revenue?

In [135]:
chipotle.groupby('item_name').item_price.sum().nlargest(1, keep='all')

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

5. Join the employees and titles DataFrames together.

In [138]:
emp_title = employees.merge(titles, left_on='emp_no', right_on='emp_no', how='inner')

emp_title

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
1,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Staff,1989-09-12,1996-09-12
2,10007,1957-05-23,Tzvetan,Zielinski,F,1989-02-10,Staff,1989-02-10,1996-02-11
3,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31
4,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Assistant Engineer,1985-02-18,1990-02-18
...,...,...,...,...,...,...,...,...,...
203179,499992,1960-10-12,Siamak,Salverda,F,1987-05-10,Staff,1987-05-10,1992-05-09
203180,499994,1952-02-26,Navin,Argence,F,1990-04-24,Engineer,1993-02-22,1993-10-27
203181,499996,1953-03-07,Zito,Baaz,M,1990-09-27,Engineer,1996-05-13,2002-05-13
203182,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
203183,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [139]:
emp_title.groupby(by=['title'])['hire_date'].max()

title
Assistant Engineer    1999-11-16
Engineer              2000-01-28
Manager               1991-08-17
Senior Engineer       1999-12-11
Senior Staff          2000-01-08
Staff                 2000-01-02
Technique Leader      1999-12-31
Name: hire_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [156]:
def get_db_url(db_name):
    from env import host, user, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    
sql = '''
SELECT * 
from departments
'''   
url = get_db_url("employees")
departments = pd.read_sql(sql, url)
departments

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [162]:
def get_db_url(db_name):
    from env import host, user, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

sql = '''
SELECT * 
from dept_emp
'''   
url = get_db_url("employees")
dept_emp = pd.read_sql(sql, url)
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [164]:
dept_with_dept_emp = departments.merge(dept_emp, left_on='dept_no', right_on='dept_no', how='inner')
dept_with_dept_emp.head()

  dept_no         dept_name  emp_no   from_date     to_date
0    d009  Customer Service   10011  1990-01-22  1996-11-09
1    d009  Customer Service   10038  1989-09-20  9999-01-01
2    d009  Customer Service   10049  1992-05-04  9999-01-01
3    d009  Customer Service   10060  1992-11-11  9999-01-01
4    d009  Customer Service   10088  1992-03-21  9999-01-01

In [167]:
titles_by_dept = dept_with_dept_emp.merge(titles, left_on='emp_no', right_on='emp_no', how='inner')
titles_by_dept.head()

,dept_no,dept_name,emp_no,from_date_x,to_date_x,title,from_date_y,to_date_y
0,d009,Customer Service,10011,1990-01-22,1996-11-09,Staff,1990-01-22,1996-11-09
1,d009,Customer Service,10038,1989-09-20,9999-01-01,Staff,1989-09-20,1996-09-20
2,d009,Customer Service,10049,1992-05-04,9999-01-01,Staff,1992-05-04,2000-05-04
3,d009,Customer Service,10060,1992-11-11,9999-01-01,Staff,1989-05-28,1996-05-28
4,d007,Sales,10060,1989-05-28,1992-11-11,Staff,1989-05-28,1996-05-28

In [173]:
pd.crosstab(titles_by_dept.title, titles_by_dept.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,230,5936,0,0,0,4903,1398,301,0
Engineer,1735,42458,0,0,0,36324,10108,2156,0
Manager,3,1,1,1,1,3,3,1,1
Senior Engineer,237,5962,0,0,0,5049,1474,320,0
Senior Staff,1576,162,1489,1431,1569,147,0,1418,4159
Staff,12248,1109,10730,10926,12316,1129,0,10289,31841
Technique Leader,68,1566,0,0,0,1347,373,72,0